Revit 2026 API

# StructuralSectionUtilsGetStructuralSection Method

---

Return structural section from element.

**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static StructuralSection GetStructuralSection(
	Document document,
	ElementId elementId
)
```
```vb
Public Shared Function GetStructuralSection (
	document As Document,
	elementId As ElementId
) As StructuralSection
```
```cpp
public:
static StructuralSection^ GetStructuralSection(
	Document^ document,
	ElementId^ elementId
)
```
```fsharp
static member GetStructuralSection :
        document : Document *
        elementId : ElementId -> StructuralSection
```

#### Parameters

document Document
     The document that owns the family for beam, brace or structural column.
elementId ElementId
     ID of family symbol or family instance for beam, brace or structural column.

#### Return Value

StructuralSection Structural section returned if element have one. For elements that do not have structural section or can not have structural section  will be returned.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

Only beams, braces and structural columns can have structural section associated with it.

#### Reference

StructuralSectionUtils Class

Autodesk.Revit.DB.Structure.StructuralSections Namespace